module.exports = {
 config: {
   name: "الاوامر",
   version: "1.0.0",
   hasPermssion: 0,
   credits: "DRIDI-RAYEN",
   description: "اوامر البوت",
   usages: "الاوامر",
   commandCategory: "〘 الخدمات 〙",
   cooldowns: 5,
 },
 run: async ({ eva, api }) => {
   const img = await eva.stream("https://i.imgur.com/ekcml2Y.jpg","https://i.imgur.com/IjwtyYm.jpg"
);
   eva.reply(
     {
       body: menux,
       attachment : img
     },
     (err, info) => {
       setTimeout(() => {
         api.editMessage(info.messageID, change);
       }, 15000);
     }
   );
 },
};

const menux = `• ━━━━❪•الأوامــــر الرئيســية•❫━━━━ •

   ✎ : قرآن ←› سور قرآنية 
   ✎ : عواصم ←› لعبة عواصم الدول 
   ✎ : اعلام ←› لعبة اعلام الدول  
   ✎ : تخيل ←› رسم بالذكاء اصطناعي  
   ✎ : حزورة ←› لعبة الثقافة العامة 
   ✎ : المكتبة ←› مكتبة الانميات و افلام الانمي
     ✎ : تفكيك ←› سور قرآنية 
   ⌯︙ايدي -› ايدي تعريفي لحسابك . 
   ⌯︙التوب -› افضل عشر متفاعلين .
   ⌯︙دخول -› شات ايفا (الدعم) .

 ⌔︙{ المـــطــور } ← m.me/100009985120348

 ﴿ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا﴾
   ..
   `;

const change =
 "﴿ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا﴾";
