module.exports.config = {
    name: "عواصم",
    version: "1.0.0",
    hasPermssion: 0,
    credits: "DRIDI-RAYEN",
    description: "احزر عواصم الدول",
    usages: ["لعبة"],
    commandCategory: "〘 الالعاب 〙",
    cooldowns: 0
};

const questions = [





  { "question": "", "answer": "" },

  { "question": "ما هي عاصمة الجزائر؟", "answer": "الجزائر" },
  { "question": "ما هي عاصمة البحرين؟", "answer": "المنامة" },
  { "question": "ما هي عاصمة مصر؟", "answer": "القاهرة" },
  { "question": "ما هي عاصمة العراق؟", "answer": "بغداد" },
  { "question": "ما هي عاصمة الأردن؟", "answer": "عمان" },
  { "question": "ما هي عاصمة الكويت؟", "answer": "الكويت" },
  { "question": "ما هي عاصمة لبنان؟", "answer": "بيروت" },
  { "question": "ما هي عاصمة ليبيا؟", "answer": "طرابلس" },
  { "question": "ما هي عاصمة موريتانيا؟", "answer": "نواكشوط" },
  { "question": "ما هي عاصمة المغرب؟", "answer": "الرباط" },
 
  { "question": "ما هي عاصمة قطر؟", "answer": "الدوحة" },
  { "question": "ما هي عاصمة السعودية؟", "answer": "الرياض" },
  { "question": "ما هي عاصمة الصومال؟", "answer": "مقديشو" },
  { "question": "ما هي عاصمة سوريا؟", "answer": "دمشق" },
  { "question": "ما هي عاصمة تونس؟", "answer": "تونس" },
  { "question": "ما هي عاصمة الإمارات العربية المتحدة؟", "answer": "ابوظبي" },
  { "question": "ما هي عاصمة اليمن؟", "answer": "صنعاء" },








  { "question": "ما هي عاصمة هندوراس؟", "answer": "تيغوسيغالبا" },
  { "question": "ما هي عاصمة المجر؟", "answer": "بودابست" },
  { "question": "ما هي عاصمة آيسلندا؟", "answer": "ريكيافيك" },
  { "question": "ما هي عاصمة الهند؟", "answer": "نيودلهي" },
  { "question": "ما هي عاصمة إندونيسيا؟", "answer": "جاكرتا" },
  { "question": "ما هي عاصمة إيران؟", "answer": "طهران" },
  { "question": "ما هي عاصمة جمهورية أيرلندا؟", "answer": "دبلن" },
  { "question": "ما هي عاصمة فلسطين؟", "answer": "القدس" },
  { "question": "ما هي عاصمة إيطاليا؟", "answer": "روما" },
  { "question": "ما هي عاصمة جامايكا؟", "answer": "كينغستون" },
  { "question": "ما هي عاصمة اليابان؟", "answer": "طوكيو" },
  { "question": "ما هي عاصمة الأردن؟", "answer": "عمان" },
  { "question": "ما هي عاصمة كازاخستان؟", "answer": "نور سلطان" },
  { "question": "ما هي عاصمة كينيا؟", "answer": "نيروبي" },
  { "question": "ما هي عاصمة كوسوفو؟", "answer": "بريشتينا" },
  { "question": "ما هي عاصمة الكويت؟", "answer": "الكويت" },
  { "question": "ما هي عاصمة قرغيزستان؟", "answer": "بشكيك" },
  { "question": "ما هي عاصمة لاوس؟", "answer": "فيانتيان" },
  { "question": "ما هي عاصمة لاتفيا؟", "answer": "ريغا" },
  { "question": "ما هي عاصمة لبنان؟", "answer": "بيروت" },
  { "question": "ما هي عاصمة ليبيريا؟", "answer": "مونروفيا" },
  { "question": "ما هي عاصمة ليبيا؟", "answer": "طرابلس" },
  { "question": "ما هي عاصمة ليختنشتاين؟", "answer": "فادوز" },
  { "question": "ما هي عاصمة ليتوانيا؟", "answer": "فيلنيوس" },
  { "question": "ما هي عاصمة لوكسمبورغ؟", "answer": "لوكسمبورغ" },
  { "question": "ما هي عاصمة جمهورية مقدونيا؟", "answer": "سكوبيه" },
  { "question": "ما هي عاصمة مدغشقر؟", "answer": "أنتاناناريفو" },
  { "question": "ما هي عاصمة مالاوي؟", "answer": "ليلونغوي" },
  { "question": "ما هي عاصمة ماليزيا؟", "answer": "كوالالمبور" },
  { "question": "ما هي عاصمة جمهورية مالطا؟", "answer": "فاليتا" },
  { "question": "ما هي عاصمة موريتانيا؟", "answer": "نواكشوط" },
  { "question": "ما هي عاصمة موريشيوس؟", "answer": "بورت لويس" },
  { "question": "ما هي عاصمة المكسيك؟", "answer": "مكسيكو سيتي" },
  { "question": "ما هي عاصمة مولدوفا؟", "answer": "كيشيناو" },
  { "question": "ما هي عاصمة موناكو؟", "answer": "موناكو" },
  { "question": "ما هي عاصمة منغوليا؟", "answer": "أولان باتور" },
  { "question": "ما هي عاصمة الجبل الأسود؟", "answer": "بودغوريتسا" },
  { "question": "ما هي عاصمة المغرب؟", "answer": "الرباط" },
  { "question": "ما هي عاصمة موزمبيق؟", "answer": "مابوتو" },
  { "question": "ما هي عاصمة ناميبيا؟", "answer": "ويندهوك" },
  { "question": "ما هي عاصمة نيبال؟", "answer": "كاتماندو" },
  { "question": "ما هي عاصمة هولندا؟", "answer": "أمستردام" },
  { "question": "ما هي عاصمة نيوزيلندا؟", "answer": "ويلينغتون" },
  { "question": "ما هي عاصمة نيكاراغوا؟", "answer": "ماناغوا" },
  { "question": "ما هي عاصمة نيجيريا؟", "answer": "أبوجا" },
  { "question": "ما هي عاصمة كوريا الشمالية؟", "answer": "بيونغ يانغ" },
  { "question": "ما هي عاصمة النرويج؟", "answer": "أوسلو" },
  { "question": "ما هي عاصمة عُمان؟", "answer": "عمان" },
  { "question": "ما هي عاصمة باكستان؟", "answer": "إسلام آباد" },
  { "question": "ما هي عاصمة بنما؟", "answer": "بنما سيتي" },
  { "question": "ما هي عاصمة بابوا غينيا الجديدة؟", "answer": "بورت مورسبي" },
  { "question": "ما هي عاصمة باراغواي؟", "answer": "أسونسيون" },
  { "question": "ما هي عاصمة بيرو؟", "answer": "ليما" },
  { "question": "ما هي عاصمة الفلبين؟", "answer": "مانيلا" },
  { "question": "ما هي عاصمة بولندا؟", "answer": "وارسو" },
  { "question": "ما هي عاصمة البرتغال؟", "answer": "لشبونة" },
  { "question": "ما هي عاصمة قطر؟", "answer": "الدوحة" },
  { "question": "ما هي عاصمة رومانيا؟", "answer": "بوخارست" },
  { "question": "ما هي عاصمة روسيا؟", "answer": "موسكو" },
  { "question": "ما هي عاصمة رواندا؟", "answer": "كيغالي" },
  { "question": "ما هي عاصمة سانت كيتس ونيفيس؟", "answer": "باسيتير" },
  { "question": "ما هي عاصمة سانت لوسيا؟", "answer": "كاستريس" },
  { "question": "ما هي عاصمة سانت فينسنت والغرينادين؟", "answer": "كينغستاون" },
  { "question": "ما هي عاصمة ساموا؟", "answer": "أبيا" },
  { "question": "ما هي عاصمة سان مارينو؟", "answer": "سان مارينو" },
  { "question": "ما هي عاصمة السنغال؟", "answer": "داكار" },
  { "question": "ما هي عاصمة صربيا؟", "answer": "بلغراد" },
  { "question": "ما هي عاصمة سيشل؟", "answer": "فيكتوريا" },
  { "question": "ما هي عاصمة سيراليون؟", "answer": "فريتاون" },
  { "question": "ما هي عاصمة سنغافورة؟", "answer": "سنغافورة" },
  { "question": "ما هي عاصمة سلوفاكيا؟", "answer": "براتيسلافا" },
  { "question": "ما هي عاصمة سلوفينيا؟", "answer": "ليوبليانا" },
  { "question": "ما هي عاصمة جزر سليمان؟", "answer": "هونيارا" },
  { "question": "ما هي عاصمة الصومال؟", "answer": "مقديشو" },
  { "question": "ما هي عاصمة جنوب إفريقيا؟", "answer": "بيتوريا" },
  { "question": "ما هي عاصمة كوريا الجنوبية؟", "answer": "سيول" },
  { "question": "ما هي عاصمة جنوب السودان؟", "answer": "جوبا" },
  { "question": "ما هي عاصمة إسبانيا؟", "answer": "مدريد" },
  { "question": "ما هي عاصمة سريلانكا؟", "answer": "كولومبو" },
  { "question": "ما هي عاصمة السودان؟", "answer": "الخرطوم" },
  { "question": "ما هي عاصمة سوريا؟", "answer": "دمشق" },
  { "question": "ما هي عاصمة تايلاند؟", "answer": "بانكوك" },
  { "question": "ما هي عاصمة تيمور الشرقية؟", "answer": "ديلي" },
  { "question": "ما هي عاصمة توغو؟", "answer": "لومي" },
  { "question": "ما هي عاصمة تونس؟", "answer": "تونس" },
  { "question": "ما هي عاصمة تركمانستان؟", "answer": "أشغابات" },
  { "question": "ما هي عاصمة توفالو؟", "answer": "فونافوتي" },
  { "question": "ما هي عاصمة أوغندا؟", "answer": "كامبالا" },
  { "question": "ما هي عاصمة أوكرانيا؟", "answer": "كييف" }






];

module.exports.handleReply = async function ({ api, event, handleReply, Currencies }) {
    const userAnswer = event.body.trim().toLowerCase();
    const correctAnswer = handleReply.correctAnswer.toLowerCase();
    const userName = global.data.userName.get(event.senderID) || await Users.getNameUser(event.senderID);

    if (userAnswer === correctAnswer) {
        Currencies.increaseMoney(event.senderID, 20);
        api.sendMessage(`✅|  قــام ${userName} بالإجــــابة أولا وحصـــــل على 50 نجمة🌟`, event.threadID);
        api.unsendMessage(handleReply.messageID); 
    } else {
        api.sendMessage(`❎| إجـــابتك خاطئة حـــاول مــرة أخـرى`, event.threadID);
    }
};

module.exports.run = async function ({ api, event, args }) {
    const randomQuestion = questions[Math.floor(Math.random() * questions.length)];
    const correctAnswer = randomQuestion.answer;
    const question = randomQuestion.question;

    const message = `${question}`;

    api.sendMessage({ body: message }, event.threadID, (error, info) => {
        if (!error) {
            global.client.handleReply.push({
                name: this.config.name,
                messageID: info.messageID,
                correctAnswer: correctAnswer
            });
        }
    });
};
